resource/template/buoyantSimpleFoam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;


boundaryField
{
    opening
    {
        type            totalPressure;
        p0              $internalField;
    }

    inlet
    {
        type            fixedFluxPressure;
    }

    opening
    {
        type            fixedValue;
        value           $internalField;
    }

    wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
